DataProcessors/ТестированиеЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ТестированиеЗнаний</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыПараметровИгроков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыПараметровИгроков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БлокировкаЛечения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бомба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Горение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Золото</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛедянойЩит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальноеЗдоровье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МентальныйЩит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неуклюжесть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проклятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сила</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтеклянныйЩит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекущееЗдоровье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Щит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Энергия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Яд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ярость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШепотИзБездны</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыДействийПротивников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВариантыДействийПротивников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АдаптивныйИнтеллект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктивироватьБомбу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Атака</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вампиризм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаблокироватьЛечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаложитьЛедянойЩит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаложитьНеуклюжесть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаложитьПроклятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаложитьЩит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опровержение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отравить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Очищение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поджечь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СбежатьИзБоя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СломатьЩит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УвеличитьСилу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдарНаУдачу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УкрастьЗолото</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ТестированиеЗнаний/Forms/ФормаНаградаСерии/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаКлиенте
Процедура КомандаНаградаЗолото(Команда)
	СтруктураЗакрытия = Новый Структура();
	СтруктураЗакрытия.Вставить("Награда", ПредопределенноеЗначение("Перечисление.ВидыПараметровИгроков.Золото"));
	СтруктураЗакрытия.Вставить("Размер", 5);
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура КомандаНаградаКарта(Команда)
	СтруктураЗакрытия = Новый Структура();
	СтруктураЗакрытия.Вставить("Награда", ПредопределенноеЗначение("Справочник.Карты.ПустаяСсылка"));
	СтруктураЗакрытия.Вставить("Размер", 2);
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура КомандаНаградаУрон(Команда)
	СтруктураЗакрытия = Новый Структура();
	СтруктураЗакрытия.Вставить("Награда", ПредопределенноеЗначение("Перечисление.ВариантыДействийПротивников.Атака"));
	СтруктураЗакрытия.Вставить("Размер", 8);
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура КомандаНаградаЭнергия(Команда)
	СтруктураЗакрытия = Новый Структура();
	СтруктураЗакрытия.Вставить("Награда", ПредопределенноеЗначение("Перечисление.ВидыПараметровИгроков.Энергия"));
	СтруктураЗакрытия.Вставить("Размер", 1);
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры

&НаКлиенте
Процедура КомандаНаградаЩит(Команда)
	СтруктураЗакрытия = Новый Структура();
	СтруктураЗакрытия.Вставить("Награда", ПредопределенноеЗначение("Перечисление.ВидыПараметровИгроков.Щит"));
	СтруктураЗакрытия.Вставить("Размер", 6);
	Закрыть(СтруктураЗакрытия);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭнергияИгрока = Параметры.ЭнергияИгрока;
	ЗдоровьеПротивника = Параметры.ЗдоровьеПротивника;
	МаксимальноеЗдоровьеПротивника = Параметры.МаксимальноеЗдоровьеПротивника;
	МодификаторыИгрока = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из Параметры.Модификаторы Цикл
		МодификаторыИгрока.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
	УправлениеДоступностью();
	Элементы.ДекорацияЭнергияИгрока.Заголовок = "Энергия: " + Строка(ЭнергияИгрока);
	Элементы.ДекорацияЗдоровьеПротивника.Заголовок = "Противник: " + Строка(ЗдоровьеПротивника) + "/" + Строка(МаксимальноеЗдоровьеПротивника);
КонецПроцедуры

// Управляет видимостью кнопок наград в зависимости от наличия модификаторов у игрока.
//
&НаСервере
Процедура УправлениеДоступностью()
	Если ЕстьМодификаторИгрока(ПредопределенноеЗначение("Справочник.Модификаторы.ПлащМеркурия")) Тогда
		Элементы.КомандаНаградаЗолото.Видимость = Истина;
	КонецЕсли;
	Если ЕстьМодификаторИгрока(ПредопределенноеЗначение("Справочник.Модификаторы.ШлемАфины")) Тогда
		Элементы.КомандаНаградаЩит.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

// Определяет, есть ли у игрока заданный модификатор.
//
// Параметры:
//  МодификаторВход - СправочникСсылка.Модификаторы - проверяемый модификатор.
//
// Возвращаемое значение:
//  Булево - Истина, если модификатор есть у игрока.
//
&НаСервере
Функция ЕстьМодификаторИгрока(МодификаторВход)
	Возврат МодификаторыИгрока.НайтиПоЗначению(МодификаторВход) <> Неопределено;
КонецФункции
